[{"likes":62,"hackathon":"Oculus\u0027 Mobile VR Jam 2015","winner":false,"name":"Dogfight Elite VR","blurp":"Multiplayer airplane combat simulator","description":"This game is based in an idea conceived years ago as a personal project, I named it Dogfight Elite. I wanted a MMO airplane simulator on a historical context. I began a company and I tried to get funding for the project launching a kickstarter campaign which you can see at www.dogfightelite.com . We were not able to get the target funding and members of the team moved on with their lives (food! Devs also need food!) And everything was cancelled. But as many developers will know, you won’t stop something for lack of funding when it is something you just love to do! I recently found out about this challenge and I decided to give it a try all by myself. Dogfight Elite VR will be a new project just for this contest. Controls - You need a game pad to play. Use the gaze to move and touch through the menus but the gamepad to fly the airplanes, drive the tank or walk around with the soldier. The Gear VR back button will also bring up the menus for the game. Don\u0027t mix gamepad/gaze controls because the system won\u0027t know if you are selecting the button with the gamepad or the one you are gazing at. In short: menus \u003d gaze. airplane \u003d gamepad. Mechanics- You have practice missions to get yourself trained for multiplayer. The fun part is on multiplayer, there you have multiple missions that are picked randomly. You will be able to fly World War I airplanes (german and allied side), buy a parachute and a tank and then use them when they bring you down. Missions include: Capture the flag, destroy the zeppelin, bring down the aircraft carrier, destroy the enemy base and so on. Innovation- Well, you feel like you are actually inside a World War I airplane! When you drop a bomb or when an enemy gets in your six, you just need to look at your back to see where he is going. You can just look around to get a quick feeling of what\u0027s going on! The menus popup in 3d in front of you. When you are brought down and you jump into the parachute, it\u0027s very cool. You pass from sitting inside your airplane to suddenly in mid-air attached to a chute! Praying the enemy airplane won\u0027t aim at you so you can land safely. I\u0027m getting into the contest so I can get funding to continue developing and improving the game. No matter what, I will always continue working on this project. If I were lucky enough to get funding I would definitely focus on bringing the team back together and keep evolving the game. Thanks to everyone for your input and type away on the comments section! Joaquin Grech – Alias Zuperman in the game. During betas, if you see me in the skies, try to bring me down! Update: New version available at https://dl.dropboxusercontent.com/u/4340696/dogfightelite.apk Built With unity c# .net photoshop blender Try it out vrjam-submissions.s3.amazonaws.com","technologies":["unity","c#",".net","photoshop","blender"],"authors":[{"username":"joaquingrech","wins":0,"projects":1,"hackathons":1,"name":"Joaquin Grech","description":"","technologies":["android","javascript","php","java","ios","jquery","windows-phone","html5","c#",".net","unity","visual-studio"]}],"id":"dogfight-elite-vr"},
{"likes":49,"hackathon":"","winner":false,"name":"Call Serena Button","blurp":"Call Serena with press of a button","description":"The call Serena Button was a weekend hack project that I built during my summer internship at ChallengePost as a HackNY Fellow. ChallengePost has some remote employees and after our awesome developer evengelist, Neal, built a chrome extension to open hangouts with our remote employees I got the idea to bring this extension into the physical world with the help of an Arduino, Chrome Packaged App, 100mm Arcade button, and a few late nights. Essentially, the chrome packaged app just runs on the user\u0027s computer and listens for any data getting sent over a connected serial port (in our case USB) and when it receives data from the Arduino, which sends data when the button is pressed and circuit completed, it opens up a google hangout with CP\u0027s project manager, Serena. Playing with Arduinos is always fun, but I also used this as a project to learn more about developing Chrome\u0027s Packaged Apps. I have since ported it to a Node.js app running locally since it is much more flexible, but the Packaged App makes it much simpler to distribute to people who don\u0027t already have an Node environment configured on their machine. For a full blogpost on this you can check out: http://blog.challengepost.com/post/93328687487/hacking-the-office-arduinos-extensions-and-hangouts Built With chrome-app arduino serial-api hardware mac windows Try it out github.com blog.challengepost.com","technologies":["chrome-app","arduino","serial-api","hardware","mac","windows"],"authors":[{"username":"AlexWheeler","wins":0,"projects":6,"hackathons":2,"name":"Alex Wheeler","description":"Student at Boston University, Organizer Make_BU, hackNY fellow \u002714","technologies":["ruby-on-rails","ruby","api","javascript","node.js","web"]}],"id":"call-serena-button"}]